In [3]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
warnings.simplefilter('ignore')

## Create A `Series` Object

In [5]:
# Create series String
ice_cream = ['Chocolate', 'Vanilla', 'Strawberry', 'Whisky']
             
pd.Series(ice_cream)

0     Chocolate
1       Vanilla
2    Strawberry
3        Whisky
dtype: object

In [6]:
# Create series Ints
lottery = [4, 8, 15, 16, 23, 42]
pd.Series(lottery)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
# Create series Boolean
registrations = [True, False, False, False, True]
pd.Series(registrations)

0     True
1    False
2    False
3    False
4     True
dtype: bool

In [8]:
# Create Series from dict
webster = {'Zebra': 'An animal',
           'Banana': 'A delicious fruit',
           'Blue': 'A color'}
pd.Series(webster)

Zebra             An animal
Banana    A delicious fruit
Blue                A color
dtype: object

## Create A `DataFrame` Object

### Dict

In [12]:
# First method to create DataFrame from [{},{},{}]
sales = [{'account': 'LLC', 'Jan': 200, 'Feb': 150, 'Mar': 180},
          {'account': 'Co', 'Jan': 150, 'Feb': 170, 'Mar': 190},
          {'account': 'Blue Inc', 'Jan': 160, 'Feb': 195, 'Mar': 250}]
df = pd.DataFrame(sales)
df

    account  Jan  Feb  Mar
0       LLC  200  150  180
1        Co  150  170  190
2  Blue Inc  160  195  250

In [13]:
# Second method to create DataFrame from [{-:[],-:[],-:[]}, from_dict
sales = {'account': ['LLC', 'Co', 'Blue Inc'],
         'Jan': [200, 150, 160],
         'Feb': [150, 170, 195],
         'Mar': [180, 190, 250]}
df = pd.DataFrame(series)
df

    account  Jan  Feb  Mar
0       LLC  200  150  180
1        Co  150  170  190
2  Blue Inc  160  195  250

### List

In [16]:
# Third method to create DataFrame from sales=[(),(),()] labels=['','','',''] from_records(sales, columns=labels)
sales = [('LLC', 200, 150, 180),
         ('Co', 150, 170, 190),
         ('Blue Inc', 160, 195, 250)]
labels = ['account', 'Jan', 'Feb', 'Mar']
df = pd.DataFrame.from_records(sales, columns=labels)
df

    account  Jan  Feb  Mar
0       LLC  200  150  180
1        Co  150  170  190
2  Blue Inc  160  195  250

### 4th method deprecated - Don't USE IT

In [9]:
# Fourth method to create DataFrame is DEPRECATED. Don't use it. 
# sales = ['',['','','']], ('',['','',''], etcX2 from_items(sales)
sales = [('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
         ('Jan', [150, 200, 50]),
         ('Feb', [200, 210, 90]),
         ('Mar', [140, 215, 95])]
df = pd.DataFrame.from_items(sales)

# Data Input Formats

In [17]:
exchange_rates = pd.read_csv("Data/dollar_euro.txt", sep="\t")
exchange_rates

    Year   Average  Min USD/EUR  Max USD/EUR  Working days
0   2016  0.901696     0.864379     0.959785           247
1   2015  0.901896     0.830358     0.947688           256
2   2014  0.753941     0.716692     0.823655           255
3   2013  0.753234     0.723903     0.783208           255
4   2012  0.778848     0.743273     0.827198           256
5   2011  0.719219     0.671953     0.775855           257
6   2010  0.755883     0.686672     0.837381           258
7   2009  0.718968     0.661376     0.796495           256
8   2008  0.683499     0.625391     0.802568           256
9   2007  0.730754     0.672314     0.775615           255
10  2006  0.797153     0.750131     0.845594           255
11  2005  0.805097     0.740357     0.857118           257
12  2004  0.804828     0.733514     0.847314           259
13  2003  0.885766     0.791766     0.963670           255
14  2002  1.060945     0.953562     1.165773           255
15  2001  1.117587     1.047669     1.192748           255
16  2000  1.085899     0.962649     1.211827           255
17  1999  0.939475     0.848176     0.998502           261

In [21]:
column_names =['Country'] + list(range(2002,2013))
male_pop = pd.read_csv("Data/countries_male_population.csv",
            header=None,
            index_col=0,
            names=column_names)
female_pop = pd.read_csv("Data/countries_female_population.csv",
            header=None,
            index_col=0,
            names=column_names)
population = male_pop + female_pop
population.to_csv("Data/countries_total_population.csv")
population.head()

,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012
Country,,,,,,,,,,,
Australia,19640979.0,19872646,20091504,20339759,20605488,21015042,21431781,21874920,22342398,22620554,22683573
Austria,8139310.0,8067289,8140122,8206524,8265925,8298923,8331930,8355260,8375290,8404252,8443018
Belgium,10309725.0,10355844,10396421,10445852,10511382,10584534,10666866,10753080,10839905,10366843,11035958
Canada,NaN,31361611,31372587,31989454,32299496,32649482,32927372,33327337,33334414,33927935,34492645
Czech Republic,10269726.0,10203269,10211455,10220577,10251079,10287189,10381130,10467542,10506813,10532770,10505445

In [22]:
titanic = pd.read_csv("Data/titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
titanic.to_excel("Data/titanic.xlsx", sheet_name="passengers", index=False)

In [26]:
titanic_excel = pd.read_excel("Data/titanic.xlsx", sheet_name="passengers")
titanic_excel.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Working with JSON

In [27]:
# when JSON is a simple dict:
a_dict = {
    'school': 'ABC primary school',
    'location': 'Vilnius',
    'ranking': 1,
}
pd.json_normalize(a_dict)

               school location  ranking
0  ABC primary school  Vilnius        1

In [28]:
# when a list of dicts
json_list = [
    { 'class': 'Year 1', 'student number': 20, 'name': 'Yellow' },
    { 'class': 'Year 2', 'student number': 25, 'name': 'Blue' },
]
pd.json_normalize(json_list)

    class  student number    name
0  Year 1              20  Yellow
1  Year 2              25    Blue

In [29]:
# when JSON is a nested list
json_obj = {
    'school': 'ABC primary school',
    'location': 'Lithuania',
    'ranking': 1,
    'info': {
        'president': 'Edgaras',
        'contacts': {
            'email': {
                'admission': 'admission@abc.com',
                'general': 'info@abc.com'
            },
            'tel': '123456789',
        }
    },
    'students': [
        { 'name': 'Agne' },
        { 'name': 'Viaceslav' },
        { 'name': 'Antanas'}
    ],
}
pd.json_normalize(json_obj)

,school,location,ranking,students,info.president,info.contacts.email.admission,info.contacts.email.general,info.contacts.tel
0,ABC primary school,Lithuania,1,"[{'name': 'Agne'}, {'name': 'Viaceslav'}, {'na...",Edgaras,admission@abc.com,info@abc.com,123456789

In [31]:
pd.json_normalize(json_obj, record_path=['students'])

        name
0       Agne
1  Viaceslav
2    Antanas

In [32]:
# when errors like nan
data = [
    {
        'class': 'Year 1',
        'student count': 20,
        'room': 'Yellow',
        'info': {
            'teachers': {
                'math': 'Deividas',
                'physics': 'Vidmantas',
            }
        },
        'students': [
            { 'name': 'Agne', 'sex': 'F' },
            { 'name': 'Viaceslav', 'sex': 'M'},
        ]
    },
    {
        'class': 'Year 2',
        'student count': 25,
        'room': 'Blue',
        'info': {
            'teachers': {
                # no math teacher
                'physics': 'Erikas',
            }
        },
        'students': [
            { 'name': 'Antanas', 'sex': 'M' },
            { 'name': 'Ausra', 'sex': 'F'},
        ]
    },
]

In [34]:
pd.json_normalize(
    data,
    record_path=['students'],
    meta=['class', 'room', ['info', 'teachers', 'math']],
    errors='ignore'
)

        name sex   class    room info.teachers.math
0       Agne   F  Year 1  Yellow           Deividas
1  Viaceslav   M  Year 1  Yellow           Deividas
2    Antanas   M  Year 2    Blue                NaN
3      Ausra   F  Year 2    Blue                NaN

## <i>Exploring the NBA data</i>

In [40]:
nba = pd.read_csv("Data/nba.csv")
nba.columns
nba.count
nba.head(5)

<bound method DataFrame.count of               Name            Team  Number Position   Age Height  Weight  \
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
..             ...             ...     ...      ...   ...    ...     ...
452     Trey Lyles       Utah Jazz    41.0       PF  20.0   6-10   234.0
453   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
454      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
455   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
456    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0

               College     Salary
0                Texas  7730337.0
1            Marquette  6796117.0
2    Boston University        NaN
3        Georgia State  1148640.0
4                  NaN  5000000.0
..                 ...        ...
452           Kentucky  2239800.0
453             Butler  2433333.0
454                NaN   900000.0
455                NaN  2900000.0
456             Kansas   947276.0

[457 rows x 9 columns]>

# <b> More useful for data analysis is manipulating A `Dataframe` Object </b>

## Some shared methods and attributes with `Series`

In [41]:
#front
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [42]:
#end
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [43]:
#idx
nba.index

RangeIndex(start=0, stop=457, step=1)

In [44]:
#values
nba.values

array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
        7730337.0],
       ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
        6796117.0],
       ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
        'Boston University', nan],
       ...,
       ['Raul Neto', 'Utah Jazz', 25.0, ..., 179.0, nan, 900000.0],
       ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
       ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0]],
      dtype=object)

In [45]:
#columns
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [46]:
# Take one column .Team
nba.Team

0      Boston Celtics
1      Boston Celtics
2      Boston Celtics
3      Boston Celtics
4      Boston Celtics
            ...
452         Utah Jazz
453         Utah Jazz
454         Utah Jazz
455         Utah Jazz
456         Utah Jazz
Name: Team, Length: 457, dtype: object

In [26]:
# Take one column 'Team'
nba['Team']

In [48]:
nba.dtypes.value_counts()

object     5
float64    4
dtype: int64

## Same `Series` attributes

In [50]:
nba_series = pd.read_csv("Data/nba.csv", usecols = ["Name"], squeeze = True)
nba_series.head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [57]:
nba_series.values
# nba_series.index
# nba_series.dtype
nba_series.value_counts()
# nba_series.value_counts().sum()
# nba_series.count()
# nba_series.is_unique
# nba_series.ndim

Avery Bradley       1
Kyle Korver         1
Al Horford          1
Kirk Hinrich        1
Tim Hardaway Jr.    1
                   ..
Eric Moreland       1
Ben McLemore        1
Kosta Koufos        1
Rudy Gay            1
Jeff Withey         1
Name: Name, Length: 457, dtype: int64

In [60]:
s = pd.Series([1.0, 2.0, 2.0, 243.0])
s.value_counts().sum()
s.count()

4

## Select one column from A `DataFrame` Object

In [62]:
# nba_one['Team'] vs nba_one[["Team"]]
nba_one = pd.read_csv("Data/nba.csv")
nba['Team'].head()
nba[['Team']].head()

             Team
0  Boston Celtics
1  Boston Celtics
2  Boston Celtics
3  Boston Celtics
4  Boston Celtics

## Select two or more columns from A `DataFrame` Object

In [64]:
# Team, Name | Number, College | 'Salary', 'Team', 'Name'
nba = pd.read_csv("Data/nba.csv")
nba[['Team', 'Name']].head(3)
nba[['Team', 'Name', 'Salary']].tail(7)

          Team           Name     Salary
450  Utah Jazz     Joe Ingles  2050000.0
451  Utah Jazz  Chris Johnson   981348.0
452  Utah Jazz     Trey Lyles  2239800.0
453  Utah Jazz   Shelvin Mack  2433333.0
454  Utah Jazz      Raul Neto   900000.0
455  Utah Jazz   Tibor Pleiss  2900000.0
456  Utah Jazz    Jeff Withey   947276.0

## Add a new column to A `DataFrame` Object

In [68]:
nba['Sport'] = 'Basketball'
nba.head(3)
nba_create_column = pd.read_csv('Data/nba.csv')
nba_create_column.head()
nba_create_column.insert(3, column='Sport', value='Krepsinis')
nba_create_column.head()

,Name,Team,Number,Sport,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,Krepsinis,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,Krepsinis,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,Krepsinis,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,Krepsinis,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,Krepsinis,PF,29.0,6-10,231.0,NaN,5000000.0

## <b> Time to look at the exercises </b>

# Indexing and Filtering

In [33]:
nba = pd.read_csv("Data/nba.csv")

### Selecting

In [34]:
#Pasirenki viena stulpeli per ''

In [35]:
#Pasirenki viena stulpeli per .stulpelis

In [36]:
#Pasirenki dvi eilutes Name ir Teams per [[]]

### The `.value_counts()` method

In [37]:
#3 budai

## The `.astype()` method &  `.unique()` and `.nunique()` methods

In [38]:
#2/3 budai

nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

## Filter A `DataFrame` Based On A Condition

## Filter with More than One Condition (AND)

## Filter with More than One Condition (OR)

## Retrieve Rows by Index Label with `.loc[]`

In [39]:
nba = pd.read_csv("Data/nba.csv")

In [40]:
# another method to set index

nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

### Slicing

In [41]:
nba.reset_index(drop=True, inplace=True)

## Retrieve Row(s) by Index Position with `iloc[]`

In [42]:
nba = pd.read_csv("Data/nba.csv")

In [43]:
nba = pd.read_csv("Data/nba.csv")
# nba.sort_index(inplace = True)
# nba.head(22)

In [44]:
# nba.iloc[100:300]

## Create a new column & get biggest values

In [45]:
nba = pd.read_csv("Data/nba.csv")


# or

In [46]:

nba.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

## Set filters in `DataFrame` through `loc`

In [47]:
nba = pd.read_csv("Data/nba.csv")
# nba.set_index("Name", inplace = True)

In [48]:

# or

## Methods on the `.groupby()` method and `DataFrame` columns

In [49]:
nba = pd.read_csv("Data/nba.csv")

In [50]:
#get_group

In [51]:
#max(), min(), sum(), mean()

## Grouping by Multiple Columns

In [52]:
nba = pd.read_csv("Data/nba.csv")

## Iterating through Groups

In [53]:
nba = pd.read_csv("Data/nba.csv")

In [54]:
nba = pd.DataFrame(columns = nba.columns)
# nba

In [55]:
nba = pd.read_csv("Data/nba.csv")

## The `.agg()` Method

In [56]:
nba = pd.read_csv("Data/nba.csv")
teams=nba.groupby("Team")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

## Quick look at the Visualisations

In [57]:
# Creating a Series plot

In [58]:
# Creating a DF bar plot

In [59]:
# Creating a DF histogram plot

In [60]:
# Creating a DF scatter plot

In [61]:
# Creating a DF area plot

In [62]:
# Creating a Series pie plot

## <b> Time to look at the exercises </b>